Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-g_variants.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-g_variants.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-g_variants.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-g_variants.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-g_variants-id.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-g_variants-id.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-g_variants-id.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-g_variants-id.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-individuals.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-individuals.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-individuals.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-individuals.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-individuals-filtering_terms.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-individuals-filtering_terms.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-individuals-filtering_terms.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-individuals-filtering_terms.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-individuals-id.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-individuals-id.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-individuals-id.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-individuals-id.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-info.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-info.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-info.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-info.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-info-root.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-info-root.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-info-root.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-map.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-map.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-map.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-map.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-projects.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-projects.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-projects.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-projects.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-runs.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-runs.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-runs.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-runs.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-runs-id.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-runs-id.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-runs-id.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-runs-id.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + content_handling       = "CONVERT_TO_TEXT"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep only the last 1 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "ap-southeast-3"
      + registry_id = (known after apply)
      + repository  = (known after apply)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "sbeacon-submitdataset-lambda-containers"
      + region               = "ap-southeast-3"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.sbeacon.module.lambda-admin.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-admin.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/sbeacon-backend-admin"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-3"
      + retention_in_days           = 0
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-admin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-admin-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-admin"
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-admin-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-admin"
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Run the admin tasks."
      + filename                       = "builds/3ed5333e01b7e9ddff406ac3125eddf0f13aca44826abd50aea8e51b16158783.zip"
      + function_name                  = "sbeacon-backend-admin"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all                       = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3ed5333e01b7e9ddff406ac3125eddf0f13aca44826abd50aea8e51b16158783.zip"
              + quiet         = "true"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3ed5333e01b7e9ddff406ac3125eddf0f13aca44826abd50aea8e51b16158783.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/3ed5333e01b7e9ddff406ac3125eddf0f13aca44826abd50aea8e51b16158783.zip"
          + "timestamp" = "1769767015664589000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_docum
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.